ls()
rm(list())
rm(list=c(3,4))
#---------------------------------------------------------
a<-matrix(c(3,4,5,6,7,8,8),nrow=2)
a

str(a)

t(a)

t<-3 #不要用保留字元
#---------------------------------------------------------
a<-4
a<3
b<-(a<3)
b
str(b)
#但是換自動轉換
b*a
b+a
#---------------------------------------------------------
#a=4
(a<3)*7+(a>=(-3))*(-7)
#-7
#a=4
#這邊都是判斷
a
(a<3)*7+(a>3)*(-7)
#-7
a<-c(1,2,3,4,5)
(a<3)*7+(a>3)*(-7)
#  7  7  0 -7 -7
#---------------------------------------------------------
#as.numeric 強制轉型
(3+2i)*4i
as.numeric((3+2i)*4i)
Re((3+2i)*4i)
(3+2i)*4i - as.numeric((3+2i)*4i)
#判斷是不是實數
is.numeric((3+2i)*4i)
#---注意---
#判斷是不是實數，這邊是因為格式的不同
(-2i)*4i
is.numeric((-2i)*4i)#就算結果是-8，但仍為-8+0i
str((-2i)*4i)
#---------------------------------------------------------
#---注意---浮點數的數值
(sqrt(17)^2)==17
#TRUE
(sqrt(117)^2)==17
#FALSE
(sqrt(117)^2)==117
#FALSE
#---------------------------------------------------------
Sys.time()
#cst 中華民國時區
a<-Sys.time()
a
str(a)
Sys.time()-a
str(Sys.time()-a)
str(as.numeric(Sys.time()-a))
#---------------------------------------------------------
date1<-as.Date("0702*2016","%m%d*%Y")
date1
#"2016-07-02"
#---------------------------------------------------------
seq(1,10,2)
seq(1,10,by=2)
seq(0,200,11)
seq(as.Date("2020/01/01"),as.Date("2020/09/25"),by="month")

seq(as.Date("20200101"),as.Date("20200925"),by="month")
#---------------------------------------------------------
install.packages('lubridate')
date<-Sys.Date()
day(date)<-1
if(wday(date)<=4){
  datex = 
}
#---------------------------------------------------------
x<-c(1:10)
x
x>3
x
#循環觀念
x>c(3,12)
c(3,12) == c(3,12) 
(x<=8)&(x>4)
#找出陣列位置
x[(x<=8)&(x>4)]
which((x<=8)&(x>4))
#但是!!!
x<-c(11:20)
x[(x<=18)&(x>14)]
which((x<=18)&(x>14))
#x[]直接找絕對位置，which相對位置
x[which((x<=18)&(x>14))]
x[c(5,6,7,8)]
#
x
x[c(3,8,2)]

#---------------------------------------------------------
#精準度的問題
1/49*49
1/49*49 == 1
all.equal(sqrt(2)^2 , 2 ,tolerance = 1e-20)

all.equal(sqrt(2)^2 , 2 ,tolerance = 1e-10)

a<-sqrt(2)^2
if(all.equal(a,2,tolerance=1e-10)){
  x<-3;print(x)
}else{
  x<-4;print(x)
}
#---------------------------------------------------------
#log 是 natural log
ln(3)
exp(log(3))
#---------------------------------------------------------
paste0("homework_",Sys.Date())
str(format(Sys.Date(),"%Y%m%d"))
paste0("homework_",format(Sys.Date(),"%Y%m%d"))
paste0("homework_",as.Date(Sys.Date(),"%Y%m%d"))
paste0("homework_",format(Sys.Date(),"%Y%m%d"),seq="**")
paste0("homework_",format(Sys.Date(),"%Y%m%d"),wday()-1,seq="**")
###???
#---------------------------------------------------------
x<-matrix(rnorm(100),nrow=5)
x
dim(x)
dim(x)[1] #row
dim(x)[2] #column
nrow(x) #row
ncol(x) #column
#d 單點機率
#P 累積機率
#q 
#r 隨機亂數
qnorm(0.95)
rnorm(0.95)
#---------------------------------------------------------
seq(from=11,11,length.out = 100 )
seq(from=11,by=11,length.out = 100 )#倍數
seq(to=11,by=11,length.out = 100 )#倍數
seq(1,10,2)
#切割，均分
seq(1,10,2)
seq(1,10,,2)
seq(1,10,4)
seq(1,10,,4)
seq(to=1,from=10,,4)
seq(to=1,from=10,length.out=4)

#---------------------------------------------------------
c(1,2,3)*c(4,5,6)


#---------------------------------------------------------
S<-100
rf<-0.007
vol<-0.2
dt<-1/12
#----------CRR(1979)-------------------
u<-exp(vol*sqrt(dt))
d<-1/u
p<-(exp(rd*dt)-d)/(u-d)
#----------CRR(1979)-------------------
N<-10
# u 的降冪 ,d的升密
S*u^(seq(N,0,by=-1))*(d^(0:N))

#---------------------------------------------------------
rep(1:4,each=2)
rep(1:4,2)
rep(1:4,2,2)#複製2次，只有秀出2個
rep(1:4,2,6)#複製2次，只有秀出6個
rep(1:4,2,,3)#先each 再time
rep(1:4,2,)#
rep(rep(1:4,2),each=3)#
rep(1:4,2)#
rep(rep(1:4,2),each=3,time=3)#
##??
#---------------------------------------------------------
c(1,2,3,4,NA,5)
x<-c(1,2,3,4,NA,5)
sum(x)
sum(x,na.rm=T)
x<-c(1,2,3,4,NA,5)
cumprod(x)
cumprod(na.omit(x))
#---------------------------------------------------------
x<-runif(10)
x
sort(x)
?sort
sort(x,decreasing = T)
#找第三大
sort(x,decreasing = T)[3]
#---------------------------------------------------------
x<-c(15,34,31,1,4)
rank(x)
rank(x)[3]
x[rank(x)==2]
rank(x)[3]
rank(-x)[1]
#---------------------------------------------------------
pmax(c(1,2,3,4,5))
pmax(c(1,2,3,4,5),c(1,2,3,4,5))

#---------------樣本標準差--------------------------
n=length(x)
x<-na.omit(x) # 移除缺值
x.sd=sqrt((sum(x^2) - n*mean(x)^2)/(n-1))#sum和mean都是數值
x.sd

     

